region = {
    1: 'al', 2: 'dz', 3: 'af', 4: 'ar', 5: 'ae', 6: 'om', 7: 'az', 8: 'eg', 9: 'ie', 10: 'ee',
    11: 'ao', 12: 'ai', 13: 'ag', 14: 'at', 15: 'au', 16: 'mo', 17: 'bb', 18: 'pg', 19: 'bs', 20: 'pk',
    21: 'py', 22: 'bh', 23: 'pa', 24: 'br', 25: 'by', 26: 'bm', 27: 'bg', 28: 'mk', 29: 'bj', 30: 'be',
    31: 'is', 32: 'pl', 33: 'ba', 34: 'bo', 35: 'bz', 36: 'bw', 37: 'bt', 38: 'bf', 39: 'dk', 40: 'de',
    41: 'do', 42: 'dm', 43: 'ru', 44: 'ec', 45: 'fr', 46: 'ph', 47: 'fj', 48: 'fi', 49: 'cv', 50: 'gm',
    51: 'cg', 52: 'cd', 53: 'co', 54: 'cr', 55: 'gd', 56: 'ge', 57: 'gy', 58: 'kz', 59: 'kr', 60: 'nl',
    61: 'me', 62: 'hn', 63: 'kg', 64: 'gw', 65: 'ca', 66: 'gh', 67: 'ga', 68: 'kh', 69: 'cz', 70: 'zw',
    71: 'cm', 72: 'qa', 73: 'ky', 74: 'xk', 75: 'ci', 76: 'kw', 77: 'hr', 78: 'ke', 79: 'lv', 80: 'la',
    81: 'lb', 82: 'lt', 83: 'lr', 84: 'ly', 85: 'lu', 86: 'rw', 87: 'ro', 88: 'mg', 89: 'mv', 90: 'mt',
    91: 'mw', 92: 'my', 93: 'ml', 94: 'mu', 95: 'mr', 96: 'us', 97: 'mn', 98: 'ms', 99: 'pe', 100: 'fm',
    101: 'mm', 102: 'md', 103: 'ma', 104: 'mz', 105: 'mx', 106: 'na', 107: 'za', 108: 'nr', 109: 'ni', 110: 'np',
    111: 'ne', 112: 'ng', 113: 'no', 114: 'pw', 115: 'pt', 116: 'jp', 117: 'se', 118: 'ch', 119: 'sv', 120: 'rs',
    121: 'sl', 122: 'sn', 123: 'cy', 124: 'sc', 125: 'sa', 126: 'st', 127: 'kn', 128: 'lc', 129: 'vc', 130: 'lk',
    131: 'sk', 132: 'si', 133: 'sz', 134: 'sr', 135: 'sb', 136: 'tj', 137: 'tw', 138: 'th', 139: 'tz', 140: 'to',
    141: 'tc', 142: 'tt', 143: 'tn', 144: 'tr', 145: 'tm', 146: 'vu', 147: 'gt', 148: 've', 149: 'bn', 150: 'ug',
    151: 'ua', 152: 'uy', 153: 'uz', 154: 'es', 155: 'gr', 156: 'hk', 157: 'sg', 158: 'nz', 159: 'hu', 160: 'jm',
    161: 'am', 162: 'ye', 163: 'iq', 164: 'il', 165: 'it', 166: 'in', 167: 'id', 168: 'gb', 169: 'vg', 170: 'jo',
    171: 'vn', 172: 'zm', 173: 'td', 174: 'cl', 175: 'cn'
}

region_name = {
    'al': '阿尔巴尼亚', 'dz': '阿尔及利亚', 'af': '阿富汗', 'ar': '阿根廷', 'ae': '阿拉伯联合酋长国', 'om': '阿曼', 'az': '阿塞拜疆', 'eg': '埃及',
    'ie': '爱尔兰', 'ee': '爱沙尼亚',
    'ao': '安哥拉', 'ai': '安圭拉', 'ag': '安提瓜和巴布达', 'at': '奥地利', 'au': '澳大利亚', 'mo': '澳门特别行政区', 'bb': '巴巴多斯',
    'pg': '巴布亚新几内亚', 'bs': '巴哈马', 'pk': '巴基斯坦',
    'py': '巴拉圭', 'bh': '巴林', 'pa': '巴拿马', 'br': '巴西', 'by': '白俄罗斯', 'bm': '百慕大', 'bg': '保加利亚', 'mk': '北马其顿', 'bj': '贝宁',
    'be': '比利时',
    'is': '冰岛', 'pl': '波兰', 'ba': '波斯尼亚和黑塞哥维纳', 'bo': '玻利维亚', 'bz': '伯利兹', 'bw': '博茨瓦纳', 'bt': '不丹', 'bf': '布基纳法索',
    'dk': '丹麦', 'de': '德国',
    'do': '多米尼加共和国', 'dm': '多米尼克', 'ru': '俄罗斯', 'ec': '厄瓜多尔', 'fr': '法国', 'ph': '菲律宾', 'fj': '斐济', 'fi': '芬兰',
    'cv': '佛得角', 'gm': '冈比亚',
    'cg': '刚果共和国', 'cd': '刚果民主共和国', 'co': '哥伦比亚', 'cr': '哥斯达黎加', 'gd': '格林纳达', 'ge': '格鲁吉亚', 'gy': '圭亚那', 'kz': '哈萨克斯坦',
    'kr': '韩国', 'nl': '荷兰',
    'me': '黑山', 'hn': '洪都拉斯', 'kg': '吉尔吉斯斯坦', 'gw': '几内亚比绍', 'ca': '加拿大', 'gh': '加纳', 'ga': '加蓬', 'kh': '柬埔寨',
    'cz': '捷克共和国', 'zw': '津巴布韦',
    'cm': '喀麦隆', 'qa': '卡塔尔', 'ky': '开曼群岛', 'xk': '科索沃', 'ci': '科特瓦迪', 'kw': '科威特', 'hr': '克罗地亚', 'ke': '肯尼亚',
    'lv': '拉脱维尔', 'la': '老挝',
    'lb': '黎巴嫩', 'lt': '立陶宛', 'lr': '利比里亚', 'ly': '利比亚', 'lu': '卢森堡', 'rw': '卢旺达', 'ro': '罗马尼亚', 'mg': '马达加斯加',
    'mv': '马尔代夫', 'mt': '马耳他',
    'mw': '马拉维', 'my': '马来西亚', 'ml': '马里', 'mu': '毛里求斯', 'mr': '毛里塔尼亚', 'us': '美国', 'mn': '蒙古', 'ms': '蒙特塞拉特',
    'pe': '秘鲁', 'fm': '密克罗尼西亚',
    'mm': '缅甸', 'md': '摩尔多瓦', 'ma': '摩洛哥', 'mz': '莫桑比克', 'mx': '墨西哥', 'na': '纳米比亚', 'za': '南非', 'nr': '瑙鲁',
    'ni': '尼加拉瓜', 'np': '尼泊尔',
    'ne': '尼日尔', 'ng': '尼日利亚', 'no': '挪威', 'pw': '帕劳', 'pt': '葡萄牙', 'jp': '日本', 'se': '瑞典', 'ch': '瑞士', 'sv': '萨尔瓦多',
    'rs': '塞尔维亚',
    'sl': '塞拉利昂', 'sn': '塞内加尔', 'cy': '塞浦路斯', 'sc': '塞舌尔', 'sa': '沙特阿拉伯', 'st': '圣多美和普林西比', 'kn': '圣基茨和尼维斯',
    'lc': '圣卢西亚', 'vc': '圣文森特和格林纳丁斯', 'lk': '斯里兰卡',
    'sk': '斯洛伐克', 'si': '斯洛文尼亚', 'sz': '斯威士兰', 'sr': '苏里南', 'sb': '所罗门群岛', 'tj': '塔克吉斯坦', 'tw': '台湾地区', 'th': '泰国',
    'tz': '坦桑尼亚', 'to': '汤加',
    'tc': '特克斯和凯科斯群岛', 'tt': '特立尼达和多巴哥', 'tn': '突尼斯', 'tr': '土耳其', 'tm': '土库曼斯坦', 'vu': '瓦努阿图', 'gt': '危地马拉',
    've': '委内瑞拉', 'bn': '文莱', 'ug': '乌干达',
    'ua': '乌克兰', 'uy': '乌拉圭', 'uz': '乌兹别克斯坦', 'es': '西班牙', 'gr': '希腊', 'hk': '香港特别行政区', 'sg': '新加坡', 'nz': '新西兰',
    'hu': '匈牙利', 'jm': '牙买加',
    'am': '亚美尼亚', 'ye': '也门', 'iq': '伊拉克', 'il': '以色列', 'it': '意大利', 'in': '印度', 'id': '印度尼西亚', 'gb': '英国',
    'vg': '英属维尔京群岛', 'jo': '约旦',
    'vn': '越南', 'zm': '赞比亚', 'td': '乍得', 'cl': '智利', 'cn': '中国大陆'
}

headers = {
    'User-Agent':
        'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.97 Safari/537.36'
}
